<a href="https://colab.research.google.com/github/Shin-Sangseok/Google_colab_practice/blob/main/label_encoding.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
from sklearn.preprocessing import LabelEncoder
import numpy as np 
import pandas as pd

In [ ]:
### 라벨 인코딩할 컬럼이 1개인 경우

In [ ]:
계절 = ['봄','여름','가을','겨울'] #데이터프레임은 인덱스와 많은 시리즈들의 결합

In [ ]:
#df = index + Series들 
#Series = index + values(ndarray)

In [ ]:
#df에서 하나의 열은 Series

In [ ]:
data = pd.Series(계절)
data

0     봄
1    여름
2    가을
3    겨울
dtype: object

In [ ]:
encoder = LabelEncoder()

In [ ]:
encoder.fit(data) #encoding해줄 데이터를 정리해주는 개념 
#어떤 것을 어떤 번호로 인코딩해야할지 정하는 역할 
#가을(0), 겨울(1), 봄(2), 여름(3)

LabelEncoder()

In [ ]:
encoder.classes_ #ㄱ,ㄴ,ㄷ,ㄹ 순

array(['가을', '겨울', '봄', '여름'], dtype=object)

In [ ]:
변환할컬럼 = ['가을','겨울','봄','여름','봄','여름','겨울','봄','여름','봄','여름']

In [ ]:
target = pd.Series(변환할컬럼)
target

0     가을
1     겨울
2      봄
3     여름
4      봄
5     여름
6     겨울
7      봄
8     여름
9      봄
10    여름
dtype: object

In [ ]:
target2 = encoder.transform(target) #fit 시키고 transform 시키는 경우 
print(target2, type(target2))

[0 1 2 3 2 3 1 2 3 2 3] <class 'numpy.ndarray'>

In [ ]:
#inverse: 거꾸로 되돌리다 
array1 = [1,3,4,5,7,8,9]
list.reverse(array1)
array1

[9, 8, 7, 5, 4, 3, 1]

In [ ]:
target3 = encoder.inverse_transform(target2)
target3

array(['가을', '겨울', '봄', '여름', '봄', '여름', '겨울', '봄', '여름', '봄', '여름'],
      dtype=object)

In [ ]:
##라벨 인코딩할 컬럼이 2-3개인 경우

In [ ]:
words = ['apple','summer','summer','spring','spring']
hobby = ['book', 'run','talk','coffee','song']

In [ ]:
df = pd.DataFrame({
    'words':words,
    'hobby':hobby
})
df

    words   hobby
0   apple    book
1  summer     run
2  summer    talk
3  spring  coffee
4  spring    song

In [ ]:
encoder2 = LabelEncoder()

In [ ]:
col = df.columns
col

Index(['words', 'hobby'], dtype='object')

In [ ]:
for c in col:
    df[c] = encoder2.fit_transform(df[c]) #fit와 transform 동시에 시키는 경우

In [ ]:
df

   words  hobby
0      0      0
1      2      2
2      2      4
3      1      1
4      1      3

In [ ]:
#나이(100,200,300):연속적인 값들은 (연속적인 숫자는) 라벨 인코딩할 
                    #필요없이 그대로 사용하면 된다. 
                    #int라고 생각했던 것이 바껴서 들어가면 문제가 생긴 것임. 
#나이대(어린이, 성년, 노년):연속적인 숫자가 아님 => 라벨인코딩의 대상이 됨. 
                            #category를 가지고 있음.

In [ ]:
#원-핫 인코딩안해주고 라벨인코딩만 해줘도 잘 적용이 되면 이대로 적용해도 된다.ex)titanic
#라벨 인코딩한 결과를 가지고 제대로 학습이 안되면, 정확하게 소속을 표현하는
#원-핫 인코딩으로 바꿔줘야 한다.

In [ ]:
##원-핫 인코딩##
##라벨 인코딩: 연속형이 아닌 데이터를 원하는 형태의 숫자로 바꾸어 주는 것. 
##             1)연속형이 아닌 데이터를 숫자로 변환: LabelEncoder
##             fit() -- transform()하는 경우와 fit_transform()으로 하는 경우가 있다. 
##             2)숫자로만 변환하는 경우, 컴퓨터는 연속형 숫자로 오해하여 연산을 수행을 해서 
##             의도치 않는(원하지 않는)결과가 나올 수 있다. 해당됨을 나타나게 하기 위해 
##             라벨의 갯수만큼 컬럼을 만들어주고 해당되는 라벨에 표시(1)로 해주는 방법을 사용 
##             라벨 인코딩에서 원-핫 인코딩이 자주 사용된다.

In [ ]:
data2 = pd.Series(['apple','summer','spring','summer','spring'])
data2

0     apple
1    summer
2    spring
3    summer
4    spring
dtype: object

In [ ]:
data2.unique()

array(['apple', 'summer', 'spring'], dtype=object)

In [ ]:
pd.get_dummies(data2)

   apple  spring  summer
0      1       0       0
1      0       0       1
2      0       1       0
3      0       0       1
4      0       1       0

In [ ]:
df2 = pd.DataFrame({"words" : ['apple', 'summer', 'summer', 'spring', 'spring'], 
                    "hobby" : ['book', 'run','talk','coffee','song']})
df2

    words   hobby
0   apple    book
1  summer     run
2  summer    talk
3  spring  coffee
4  spring    song

In [ ]:
pd.get_dummies(df2['hobby'])

   book  coffee  run  song  talk
0     1       0    0     0     0
1     0       0    1     0     0
2     0       0    0     0     1
3     0       1    0     0     0
4     0       0    0     1     0

In [ ]:
df2.loc[:,['words','hobby']]

    words   hobby
0   apple    book
1  summer     run
2  summer    talk
3  spring  coffee
4  spring    song

In [ ]:
import pandas as pd 
csv_data = pd.read_csv('C:/Users/hi/csv-data/drinks (1).csv')
csv_data

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF
3,Andorra,245,138,312,12.4,EU
4,Angola,217,57,45,5.9,AF
...,...,...,...,...,...,...
188,Venezuela,333,100,3,7.7,SA
189,Vietnam,111,2,1,2.0,AS
190,Yemen,6,0,0,0.1,AS
191,Zambia,32,19,4,2.5,AF
192,Zimbabwe,64,18,4,4.7,AF

In [ ]:
df_samples =csv_data.loc[:,['beer_servings', 'continent']]
df_samples

     beer_servings continent
0                0        AS
1               89        EU
2               25        AF
3              245        EU
4              217        AF
..             ...       ...
188            333        SA
189            111        AS
190              6        AS
191             32        AF
192             64        AF

[193 rows x 2 columns]

In [ ]:
#beer_servings를 세개 의 그룹으로 나누기. 
#그룹으로 만들어서 1번의 결과를 beer_cat 변수로 추가 
#Label Encoding 2가지 방식으로 
#원핫인코딩 df전체 
#특정 컬럼(1개 또는 그 이상)선택해서 원핫 인코딩

In [ ]:
#pclass는 숫자가 크고 작음에 따라서 차이가 있음. 
#gender는 0에 속하느냐 1에 속하느냐의 차이이지 차이는 없다. 
#gender 같으 경우에는 차이를 넣어야하기 때문에 원-핫 인코딩을 해야 하고 
#pclass는 숫자에 따라 차이가 존재하기 때문에 해도 되고 안해줘도 된다. 
#숫자가 크기에 차이가 반영되어 있다면 원-핫 인코딩까지는 안해도 된다.

In [ ]:
df_samples['beer_servings'].describe() # 25% 20.0 50% 76.0 75% 188.0 max 376.0

count    193.000000
mean     106.160622
std      101.143103
min        0.000000
25%       20.000000
50%       76.000000
75%      188.000000
max      376.000000
Name: beer_servings, dtype: float64

In [ ]:
df_samples['beer_servings'] = pd.cut(
                            df_samples['beer_servings'], 
                            bins = [0,76,188,376],
                            include_lowest=  True,  
                            labels = ['low','middle','high']
                        )
df_samples

    beer_servings continent
0             low        AS
1          middle        EU
2             low        AF
3            high        EU
4            high        AF
..            ...       ...
188          high        SA
189        middle        AS
190           low        AS
191           low        AF
192           low        AF

[193 rows x 2 columns]

In [ ]:
encoder = LabelEncoder()
#beer_cat =

In [ ]:
encoder.fit(df_samples['beer_servings'])

LabelEncoder()

In [ ]:
encoder.classes_

array(['high', 'low', 'middle'], dtype=object)

In [ ]:
change_col = df_samples['beer_servings']
target = pd.Series(change_col)

In [ ]:
target

0         low
1      middle
2         low
3        high
4        high
        ...
188      high
189    middle
190       low
191       low
192       low
Name: beer_servings, Length: 193, dtype: category
Categories (3, object): ['low' < 'middle' < 'high']

In [ ]:
target2 = encoder.transform(target)
df_samples['beer_cat'] = target2

In [ ]:
df_samples

    beer_servings continent  beer_cat
0             low        AS         1
1          middle        EU         2
2             low        AF         1
3            high        EU         0
4            high        AF         0
..            ...       ...       ...
188          high        SA         0
189        middle        AS         2
190           low        AS         1
191           low        AF         1
192           low        AF         1

[193 rows x 3 columns]

In [ ]:
encoder2 = LabelEncoder()
encoder2

LabelEncoder()

In [ ]:
col = df_samples['continent']
col

0      AS
1      EU
2      AF
3      EU
4      AF
       ..
188    SA
189    AS
190    AS
191    AF
192    AF
Name: continent, Length: 193, dtype: object

In [ ]:
col.unique()

array(['AS', 'EU', 'AF', nan, 'SA', 'OC'], dtype=object)

In [ ]:
pd.get_dummies(col)

     AF  AS  EU  OC  SA
0     0   1   0   0   0
1     0   0   1   0   0
2     1   0   0   0   0
3     0   0   1   0   0
4     1   0   0   0   0
..   ..  ..  ..  ..  ..
188   0   0   0   0   1
189   0   1   0   0   0
190   0   1   0   0   0
191   1   0   0   0   0
192   1   0   0   0   0

[193 rows x 5 columns]